In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [7]:
names=Series(['faizan','hasnain','ali','sara','iste'])

In [12]:
age=Series([18,20,16,55,40])

In [23]:
gender=Series(['M','M','M','F','M'])

In [25]:
status=Series([])

In [27]:
data=DataFrame({'Name':names,'Age':age,'Gender':gender,'Status':status})

In [28]:
data

      Name  Age Gender  Status
0   faizan   18      M     NaN
1  hasnain   20      M     NaN
2      ali   16      M     NaN
3     sara   55      F     NaN
4     iste   40      M     NaN

def CheckAge (age):
    if age>=18:
        print("Adult")
    else:
        print("Not an Adult")

CheckAge(18)

# code in class

In [30]:
students=pd.DataFrame({'Name':['faizan','ali','iste','sara','usman'],
                      'Age':np.random.randint(5,25,5),
                      'Percent':np.random.randint(50,90,5)})

In [31]:
students

     Name  Age  Percent
0  faizan   21       79
1     ali   23       51
2    iste    5       75
3    sara    5       86
4   usman   24       83

In [39]:
def CheckAge (Age):
    if Age>=18:
        return"Adult"
    else:
        return"Not an Adult"

In [40]:
students['Status']=students['Age'].apply(CheckAge)

In [41]:
students

     Name  Age  Percent        Status
0  faizan   21       79         Adult
1     ali   23       51         Adult
2    iste    5       75  Not an Adult
3    sara    5       86  Not an Adult
4   usman   24       83         Adult

In [42]:
def CheckPercent (Percent):
    if Percent<60:
        return"Passed"
    else:
        return"Not Passed"

In [43]:
students['Result']=students['Percent'].apply(CheckPercent)

In [44]:
students

     Name  Age  Percent        Status      Result
0  faizan   21       79         Adult  Not Passed
1     ali   23       51         Adult      Passed
2    iste    5       75  Not an Adult  Not Passed
3    sara    5       86  Not an Adult  Not Passed
4   usman   24       83         Adult  Not Passed

In [45]:
students.style()